# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model for CITYPERSONS dataset.

# Parameters
nc: 1  # number of classes (assuming only pedestrians for CITYPERSONS)
scales:  # model compound scaling constants
  s: [0.33, 0.50, 1024]  # YOLOv8s: small model
  m: [0.67, 0.75, 768]  # YOLOv8m: medium model
  l: [1.00, 1.00, 512]  # YOLOv8l: large model

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# PBFPN head
head:
  - [-1, 1, Conv, [512, 1, 1]]             # Reduce channels from 1024 to 512
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # Upsample
  - [[-1, 7], 1, Concat, [1]]             # Concat with P7

  # High-level feature fusion
  - [-1, 2, C2f, [512, False]]            # Reduce to 512 channels
  - [-1, 1, Conv, [256, 1, 1]]            # Reduce channels

  # Mid-level feature fusion
  - [5, 1, nn.Upsample, [None, 2, 'nearest']]  # Upsample to match P5
  - [[-1, 3], 1, Concat, [1]]             # Concat with P5
  - [-1, 2, C2f, [256, False]]            # Reduce to 256 channels

  # Low-level feature fusion
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # Upsample to match P4
  - [[-1, 1], 1, Concat, [1]]             # Concat with P4
  - [-1, 2, C2f, [128, False]]            # Reduce to 128 channels

  # Multi-level feature fusion
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # Upsample to match P3
  - [[-1, 1], 1, Concat, [1]]             # Concat with P3
  - [-1, 2, C2f, [128, False]]            # Reduce to 128 channels

  # Restore mid-level feature size
  - [-1, 1, Conv, [256, 3, 2]]            # Downsample to match P4
  - [[-1, 9], 1, Concat, [1]]             # Concat with P4
  - [-1, 2, C2f, [256, False]]            # Reduce to 256 channels

  # Restore high-level feature size
  - [-1, 1, Conv, [512, 3, 2]]            # Downsample to match P5
  - [[-1, 7], 1, Concat, [1]]             # Concat with P5
  - [-1, 2, C2f, [512, False]]            # Reduce to 512 channels

  # Deepest feature fusion
  - [-1, 1, Conv, [1024, 3, 2]]           # Downsample to match P6
  - [[-1, 5], 1, Concat, [1]]             # Concat with P6
  - [-1, 2, C2f, [1024, False]]           # Reduce to 1024 channels

  # Final detection features
  - [[15, 18, 21, 24], 1, Detect_FIVEFASFF, [nc]]  # Detection output
