# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels] gradients,   8.9 GFLOPs
#  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone  # [from, repeats, module, args]

backbone:
  - [-1, 1, TripletAttention_Conv_w2, [64, 3, 2]] # 0-P1/2
  - [-1, 1, TripletAttention_Conv_w2, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, TripletAttention_Conv_w2, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, TripletAttention_Conv_w2, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, TripletAttention_Conv_w2, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
# YOLOv8.0n head
head:
  - [-1, 1, Conv, [512, 1, 1]]  #10
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]   #11
  - [[-1,6], 1, Concat, [ 1 ] ]   #12
  - [ -1, 3, C2f, [ 512, False ] ] #13
  - [ -1, 1, Conv, [ 256, 1, 1 ] ] #14

  - [ 4, 3, C2f, [ 256, False ] ] #15
  - [ -1, 1, Conv, [ 128, 1, 1 ] ] #16
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] #17

  - [ 2, 3, C2f, [ 128, False ] ]  #18
  - [ [ 18, 17 ], 1, Concat, [ 1 ] ]  #19
  - [ -1, 3, C2f, [ 128, False ] ]  #20
  - [ -1, 1, Conv, [ 64, 1, 1 ] ]  #21
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] #22

  - [ 18, 1, Conv, [ 64, 1, 1 ] ]  #23
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] #24

  - [0, 3, C2f, [64, False]] #25
  - [ [ 25, 24 ], 1, Concat, [ 1 ] ] #26
  - [ [ 22, 26 ], 1, Concat, [ 1 ] ] #27

  - [ -1, 3, C2f, [ 64, False ] ] #28
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] #29
  - [ [ 29, 21 ], 1, Concat, [ 1 ] ] #30
  - [ [ 30, 23 ], 1, Concat, [ 1 ] ] #31

  - [ -1, 3, C2f, [ 128, False ] ]  #32
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] #33
  - [ [ 16, 33 ], 1, Concat, [ 1 ] ]  #34
  - [ -1, 3, C2f, [ 256, False ] ]  #35
  - [ -1, 1, Conv, [ 256, 3, 2 ] ]  #36
  - [ [ -1, 14 ], 1, Concat, [ 1 ] ] #37
  - [ -1, 3, C2f, [ 512, False ] ]  #38
#  - [ -1, 1, Conv, [ 512, 3, 2 ] ]  #39
#  - [ [ -1, 10 ], 1, Concat, [ 1 ] ]  #40
#  - [ -1, 3, C2f, [ 1024, False ] ]  #41

  - [[28, 32, 35, 38], 1, Detect_FASFF, [nc]]  #42



